import React, { useEffect } from "react";
import img1 from "../../assets/history/1.png";
import img2 from "../../assets/history/2.png";
import img3 from "../../assets/history/3.png";
import img4 from "../../assets/history/4.png";
import img5 from "../../assets/history/5.png";
import img6 from "../../assets/history/6.png";
import img7 from "../../assets/history/7.png";
import img8 from "../../assets/history/8.png";
import img9 from "../../assets/history/9.png";
import img10 from "../../assets/history/10.png";
import img11 from "../../assets/history/11.png";
import img12 from "../../assets/history/12.png";
import img13 from "../../assets/history/13.png";
import img14 from "../../assets/history/14.png";
import img15 from "../../assets/history/15.png";
import img16 from "../../assets/history/16.png";
import img17 from "../../assets/history/17.png";
import img18 from "../../assets/history/18.png";
import img19 from "../../assets/history/19.png";
import img20 from "../../assets/history/20.png";
import img21 from "../../assets/history/21.png";
import img22 from "../../assets/history/22.png";
import img23 from "../../assets/history/23.png";
import img24 from "../../assets/history/24.png";
import img25 from "../../assets/history/25.png";
import img26 from "../../assets/history/26.png";
import img27 from "../../assets/history/27.png";
import img28 from "../../assets/history/28.png";
import img29 from "../../assets/history/29.png";
import img30 from "../../assets/history/30.png";
import img31 from "../../assets/history/31.png";
import img32 from "../../assets/history/32.png";
import img33 from "../../assets/history/33.png";
import img34 from "../../assets/history/34.png";
import img35 from "../../assets/history/35.png";
import img36 from "../../assets/history/36.png";
import img37 from "../../assets/history/37.png";
import { Timeline } from "antd";

const RuHistory = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  return (
    <div>
      <div className="text">
        <p>
          Ташкентский государственный транспортный университет был основан в
          1931 году под названием Среднеазиатский институт инженеров
          железнодорожного транспорта (САЗИИТ), и начал свою деятельность с
          подготовки специалистов — механиков и операторов.
        </p>
        <p>
          В 1930 году в Ташкенте под управлением Ташкентской железной дороги
          были организованы курсы по обучению и переподготовке инженеров и
          технического персонала узкой специальности.
        </p>
        <p>
          В августе 1931 года было объявлено о первом зачислении студентов, в
          результате чего 125 человек стали первыми учащимися из числа
          работников железной дороги.
        </p>
        <p>
          Преподавательский состав САЗИИТ изначально был сформирован из
          работников курсов, специалистов железнодорожного узла Красновосточного
          завода, преподавателей Среднеазиатского государственного университета,
          работающих на условиях почасовой оплаты. В состав научного совета
          вошли преподаватели, работники Среднеазиатского управления железных
          дорог, заводов и других общественных организаций.
        </p>
        <p>
          В 1931/1932 учебном году в САЗИИТе работало 35 постоянных
          преподавателей. Среди них были первые организаторы института
          М.Я.Ботолов, Ю.Гольцман, В.Димушин, М.Егоров, А.Зиновьева, А.Крафт,
          С.Новокрешченов, Нурмухамедов, М.Струсевич, Т.Кучкаров, В. Капустин,
          Х.Ходжаев, Д.Заглядимов, А.Ценин, Н.Писарев, А.Суворов, Е.Якуб и
          другие. База для проведения занятий находилась на заводе, в
          железнодорожных отделениях Ташкентского узла и Среднеазиатском
          государственном университете. Студенческие общежития располагались в
          различных районах Ташкента.
        </p>
        <p>
          В ноябре 1931 года был создан железнодорожный факультет САЗИИТ, а на
          заседании учебного совета института было принято решение о создании
          филиалов института в Ашхабаде, Красноводске, Алма-Ате и Оренбурге, а
          также об организации школ для подготовки кадров и их филиалов.
        </p>
        <p>
          В 1931 году была определена организационная структура института,
          которая включала: дирекцию; 4 отделения — «Механическое»,
          «Операционное», «Путевое» и «Переподготовка кадров»; 10 кафедр —
          железные дороги, подвижной состав, прикладная механика, методы
          изображения, прочность материалов, математика, общественные науки,
          политическая экономия, немецкий язык, физика и химия; научный совет
          института и библиотеку.
        </p>
        <p>
          До 1933 года структурные подразделения института назывались кафедрами,
          а глава института — директором. В 1933 году кафедры были преобразованы
          в факультеты, а директор — в начальника.
        </p>
        <p>
          В 1934 году состоялся первый выпуск 124 инженеров-железнодорожников по
          трем специальностям.
        </p>
      </div>
      <div className="centered-img">
        <img  loading="lazy" src={img1} alt="" />
      </div>
      <section className="pt-5 pb-5">
        <div className="container">
          <div className="row">
            <div className="col-6"></div>
            <div className="col-6 text-right">
              <a
                className="btn btn-primary mb-1 mr-1"
                href="#carouselExampleIndicators2"
                role="button"
                data-slide="prev"
              >
                <i className="fa fa-arrow-left" />
              </a>
              <a
                className="btn btn-primary mb-1"
                href="#carouselExampleIndicators2"
                role="button"
                data-slide="next"
              >
                <i className="fa fa-arrow-right" />
              </a>
            </div>
            <div className="col-12">
              <div
                id="carouselExampleIndicators2"
                className="carousel slide"
                data-ride="carousel"
              >
                <div className="carousel-inner">
                  <div className="carousel-item active">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img4}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img7}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img8}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img9}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img4}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img7}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
      <div className="text">
        <p>
          Строительство учебного здания САЗИИТ, жилого дома на 32 квартиры для
          преподавателей, двух одноэтажных временных общежитий и других
          сооружений началось в 1932 году и завершилось в 1936 году.
        </p>
        <p>
          С вводом в эксплуатацию нового здания института была расширена
          офисно-лабораторная база, учебные мастерские и жилищный фонд. Перенос
          занятий в новое здание был осуществлен, как только была готова база
          классов. Первая секция здания института была реконструирована в 1933
          году.
        </p>
        <p>
          С 1 сентября 1933 года в новом учебном здании обучались только 5
          дневных и 4 вечерних учебных группы. В первом четырехэтажном
          учебно-лабораторном здании размещались учебные мастерские и столовая.
          Строительство учебно-лабораторного корпуса было завершено в 1936 году.
        </p>
        <p>
          Книжный фонд библиотеки был не велик: в 1931 году насчитывал 4812
          экземпляров, а к 1938 году — 12 225 экземпляров. Спрос на книги,
          журналы и специализированную литературу превышал их наличие, что
          вызвало необходимость регулярной подготовки учебных пособий и
          справочников для курсовых и дипломных работ преподавателями института.
        </p>
        <p>
          В 1933-1935 годах организационная структура института частично
          изменилась. В феврале 1933 года механический факультет был
          преобразован в локомотивный, а в сентябре 1934 года был создан
          факультет локомотивов. В ноябре 1933 года был создан специальный
          целевой факультет (ФОН) для переподготовки руководящих кадров
          Среднеазиатской и Туркестано-Сибирской железных дорог. За короткий
          срок там прошли переподготовку 80 руководящих работников.
        </p>
        <p>
          В 1937 году САЗИИТ был переименован в Ташкентский институт инженеров
          железнодорожного транспорта (ТашИИТ). За первые 10 лет работы институт
          подготовил и выпустил 156 техников и 891 инженера, из них 249
          локомотивщиков, 229 путейцев, 118 железнодорожников, 138 строителей
          железных дорог, 157 технических работников. Во время Второй мировой
          войны в институте действовал строгий государственный план набора по
          225-250 человек на три факультета ежегодно.
        </p>
        <p>
          В 1941 году на первый курс факультетов паровозов, дорожного
          строительства и эксплуатации было принято 227 студентов.
        </p>
        <p>
          Война нарушила мирный ритм работы института. С первых дней войны
          многие преподаватели добровольно ушли на фронт, среди них: Н.П.
          Александров, Н.Г. Кочиев, Б.А. Ларионов, Б.В. Волков, М.Ф. Прасолов,
          Д.В. Пиццов, С.В. Субботин и другие сотрудники.
        </p>
        <p>
          Осенью первого года войны, в чрезвычайно трудное время, сотрудники
          института, во многом лишая себя, проявили традиционное узбекское
          гостеприимство.
        </p>
      </div>
      <div className="centered-img">
        <img  loading="lazy" src={img2} alt="" />
        <img  loading="lazy" src={img3} alt="" />
      </div>
      <div className="text">
        <p>
          В первый год войны коллектив института, во многом отказывая себе,
          проявил традиционное гостеприимство, свойственное узбекскому народу.
          Были приняты и размещены эвакуированные преподаватели и студенты из
          других транспортных вузов. Так, в сентябре 1941 г. была принята
          большая группа студентов ЛИИЖТа. В ноябре-декабре 1941 г. прибыли и
          были размещены преподаватели, студенты и административно-технический
          персонал Харьковского института инженеров железнодорожного транспорта
          (ХИИТ). Все это вызвало необходимость проведения ряда
          организационно-технических должностных перемещений административного
          характера, изменение состава кафедр и совета института. Учебные
          занятия были организованы в две смены.
        </p>

        <p>
          На протяжении всех лет войны институт имел твердый план ежегодного
          приема на все три факультета. В 1942 г. в институте организуются
          краткосрочные хозрасчетные курсы по подготовке абитуриентов. На курсы
          принимались лица, имеющие подготовку 8—10 классов средней школы, и в
          зависимости от этого предусматривались занятия от одного до шести
          месяцев. Вскоре эти курсы были реорганизованы в дневное
          подготовительное отделение с трех, шести и восьмимесячными сроками
          обучения. Как и студенты института, слушатели подготовительного
          отделения пользовались всеми льготами железнодорожников.
        </p>

        <p>
          Бессменным руководителем подготовительного отделения была завкафедрой
          «Языки» Ф.Л.Марканова. Отделение насчитывало 8 академических групп,
          примерно 200 слушателей. На курсах работали преподаватели
          общеобразовательных кафедр института и средних школ города.
        </p>

        <p>
          При содействии Ташкентской и Туркестано-Сибирской железных дорог была
          организована сеть филиалов подготовительного отделения на базе
          выпускников десятых классов при русских, узбекских и казахских
          железнодорожных школах в Андижане, Коканде, Алма-Ате, Бишкеке и
          Джамбуле.
        </p>

        <p>
          Война потребовала коренной перестройки всего учебного процесса. С 1941
          г. вводится сокращенный 3-годичный срок подготовки инженеров. Была
          проделана большая работа по пересмотру учебных планов и программ
        </p>

        <p>
          Однако переход на сокращенный срок обучения привел к ухудшению
          качества подготовки специалистов. Поэтому уже с нового 1942/43
          учебного года для всех транспортных институтов страны устанавливается
          единая продолжительность обучения студентов — 4 года 10 месяцев.
          Выпускникам присваивается квалификация: инженер путей сообщения –
          механик, инженер путей сообщения – строитель, инженер путей сообщений
          по движению и грузовой работе.
        </p>

        <p>
          В годы войны продолжалось совершенствование организационной структуры
          института. Создается ряд новых кафедр и лабораторий, отвечающих
          требованиям времени. Организованы кафедры технологии металлов,
          теплотехники, организации движения поездов, станций и узлов,
          организации грузовой работы гражданских сооружений, геологии,
          экономики транспорта и др.
        </p>

        <p>
          Книжный фонд библиотеки института пополнился за счет библиотечного
          фонда ХИИТа и составил примерно 140 тыс. томов. В 1943/44 учебном году
          создалась фундаментальная библиотека в специально оборудованном
          помещении. Для лучшего обслуживания студентов читальный зал библиотеки
          стал работать до 23 часов.
        </p>

        <p>
          Итоги научно-исследовательской деятельности и работы по оказанию
          помощи производству в годы Второй мировой войны были подведены в 1944
          году на научно-технической конференции кафедр института. В работе
          конференции приняли участие свыше 100 работников дороги.
        </p>

        <p>В годы Второй мировой войны институт выпустил 508 инженеров.</p>

        <p>С 1944 г. начальники факультетов стали именоваться деканами.</p>

        <p>
          СВОЙ ПЕРВЫЙ ПОСЛЕВОЕННЫЙ УЧЕБНЫЙ ГОД ИНСТИТУТ НАЧАЛ С ТРЕХ
          ФАКУЛЬТЕТОВ:
        </p>

        <ul>
          <li>СТРОИТЕЛЬСТВО</li>
          <li>МЕХАНИКА</li>
          <li>ЭКСПЛУАТАЦИЯ ЖЕЛЕЗНЫХ ДОРОГ</li>
        </ul>

        <p>
          Свой первый послевоенный учебный год институт начал с трех
          факультетов: «Строительный», «Механический» и «Эксплуатация железных
          дорог».
        </p>

        <p>
          Несмотря на трудные послевоенные годы в институте не прекращались
          строительные работы, направленные на улучшение материально-технической
          базы института. Так, в 1946 г. началось строительство нового
          четырехэтажного комплекса института. Одновременно предусматривалось
          строительство здания для размещения учебно-экспериментальных
          мастерских, теплотехнических лабораторий и центральной котельной,
          спортивного городка открытого типа, электроподстанции и
          банно-прачечного комплекса.
        </p>

        <p>
          Первая секция нового учебного корпуса была сдана в эксплуатацию в 1948
          г., а вторая — в 1950 г.
        </p>

        <p>
          В 1965 г. завершена газификация института. На природный газ переведены
          жилые дома, студенческие общежития и котельная.
        </p>

        <p>
          В 1966 г. сдано в эксплуатацию трехэтажное здание столовой на 500
          посадочных мест. В 1968 г. построены комбинированные детсад ясли на
          140 мест, в 1969 г. еще одно студенческое общежитие. В 1971 г.
          закончено строительство нового 56-квартирного дома, а в 1975 г.—
          студенческого общежития № 6.
        </p>

        <p>
          После окончания строительства основного учебного здания началось
          строительство жилых домов, общежитий и бытовых зданий. В 1958—60 гг.
          построено два общежития на 400 человек каждое. В 1961 г. сдан
          60-квартирный жилой дом для преподавателей и сотрудников института. В
          1962 г. построены студенческие общежития на 411 мест и детский сад на
          100 мест, в 1963 и 1964 гг. — два 32-квартирных жилых дома.
        </p>

        <p>
          Если площадь кабинетов и лабораторий в 1937 г. была около 3000 кв.м.,
          то уже к 1970 г. она составляло 21500 кв.м.
        </p>

        <p>
          С 1947 г. в институте было открыто вечернее отделение, на базе
          которого в 1955 г. создан вечерний факультет.
        </p>

        <p>
          В 1957 г. заочное отделение института было реорганизовано в факультет.
          Заочный факультет создал учебно-консультационные пункты (УКП) в гг.
          Ашхабаде, Алма-Ате и Оренбурге.
        </p>
      </div>
      <div className="three-img">
        <img  loading="lazy" src={img5} alt="" />
        <img  loading="lazy" src={img6} alt="" />
        <img  loading="lazy" src={img10} alt="" />
      </div>
      <div className="text">
        <p>
          Рост промышленного и гражданского строительства требовал большого
          количества инженеров–строителей. В связи с этим в 1954 году
          строительным факультетом института был осуществлен прием студентов на
          новую специальность – промышленное и гражданское строительство (ПГС),
          выделившуюся в 1956 году в самостоятельный факультет ПГС.
        </p>

        <p>
          Вслед за этим на эксплуатационный факультет были приняты первые группы
          студентов по специальности «Автоматика, телемеханика и связь на
          железнодорожном транспорте». На базе этих групп в 1961 году был создан
          факультет АТС.
        </p>

        <p>
          В 1959 году институт произвел прием студентов по специальности
          «Экономика и организация железнодорожного транспорта». С 1965 года эта
          специальность вместе со специальностью «Бухгалтерский учет на
          железнодорожном транспорте» позволила сформировать
          инженерно-экономический факультет (ЭТ), который в 1988 году был
          объединен с факультетом «Управление процессами перевозок на
          железнодорожном транспорте».
        </p>

        <p>
          С 1 января 1969 года при институте был открыт факультет повышения
          квалификации (ФПК) руководящих работников и специалистов
          железнодорожного транспорта.
        </p>

        <p>
          К 1981 г. в институте уже имелось 80 лабораторий и кабинетов и 4
          научно-исследовательские отраслевые лаборатории. Особенно быстро
          развивалась лабораторная база факультета АТС. За 10 лет на этом
          факультете были созданы 23 лаборатории, аппаратура и приборы которых
          соответствуют современному уровню устройств АТС на железных дорогах.
          На эксплуатационном факультете был построен макет электрифицированного
          железнодорожного участка с 8 станциями, техническое оснащение которого
          позволяло отрабатывать современные способы организации движения
          поездов. Созданы также лаборатории по тепловозам, вагонам,
          электрическим машинам, строительной механике, технологии металлов,
          стройматериалам и другие специальные кабинеты и лаборатории.
        </p>

        <p>
          В 1981 г. введена в эксплуатацию 7-я секция учебного корпуса —
          учебно-спортивный комплекс, включающий лабораторный блок на 640 мест,
          аудиторный блок с двумя аудиториями, на 200 мест каждая, универсальный
          спортивный зал.
        </p>

        <p>
          В 1989 г. было завершено строительство студенческого общежития N°1.
        </p>

        <p>
          В 1990 году введен в эксплуатацию учебно-лабораторный корпус для
          локомотивов типа «Калек».
        </p>

        <p>
          За годы независимости институтом были налажены международные связи с
          ведущими высшими техническими учебными заведениями Москвы, Санкт –
          Петербурга, Прибалтики, Восточной Европы и Азии подписаны научно –
          творческие договора. Установлены отношения Казахстанской академией
          транспорта и коммуникации, Киргизским университетом строительства,
          архитектуры и транспорта, Киевским национальным
          архитектурно-строительным институтом и многими другими научно –
          исследовательскими институтами.
        </p>

        <p>
          В мае 2020 года Глава государства Шавкат Миромонович Мирзиёев подписал
          Постановление “О мерах по кардинальному совершенствованию системы
          подготовки кадров в сфере транспорта”. Согласно Постановлению
          Ташкентский институт инженеров железнодорожного транспорта,
          Ташкентский институт проектирования, строительства и эксплуатации
          автомобильных дорог и факультет авиакосмических технологий
          Ташкентского государственного технического университета объединяются в
          Ташкентский государственный университет транспорта.
        </p>

        <p>
          16 июня 2020 года ректором Ташкентского государственного университета
          транспорта назначен Одил Каландарович Абдурахманов.
        </p>

        <p>
          Готовит бакалавров по 74 специальностям и магистров по 51
          специальности.
        </p>

        <p>
          В университете 9 факультетов. В них обучается более 14074 человек, из
          них 13765 студентов бакалавриата и 308 студентов магистратуры.
          Научно-педагогический состав университета насчитывает более 1000
          человек, 55 докторов наук – профессоров, 185 кандидатов наук –
          доцентов, 481 старший преподаватель и ассистент.
        </p>

        <p>
          В результате проделанной работы в университете созданы все условия для
          реализации творческих способностей студентов, спортивный клуб,
          современные удобные общежития, научно-студенческое общество. Для
          студенческой практики используют многочисленные тренажеры и
          лабораторные установки.
        </p>

        <p>
          Успешное сотрудничество ученых института и производственников железной
          дороги способствует росту квалификации научно-педагогических кадров и
          укреплению материальной базы университета.
        </p>
      </div>
      <div className="d-flex justify-content-center">
        <Timeline
          items={[
            {
              children: (
                <div>
                  <h4>САЗИИТ</h4>
                  <h5>931-1937 годы</h5>
                  <p>
                    Среднеазиатский институт инженеров железнодорожного
                    транспорта
                  </p>
                </div>
              ),
            },
            {
              children: (
                <div>
                  <h4>ТашИИТ</h4>
                  <h5>1937-2020 годы</h5>
                  <p>
                    Ташкентский институт инженеров железнодорожного транспорта
                  </p>
                </div>
              ),
            },
            {
              children: (
                <div>
                  <h4>ТГТрУ</h4>
                  <h5>С 01.09.2020 года</h5>
                  <p>Ташкентский государственный транспортный университет</p>
                </div>
              ),
            },
          ]}
        />
      </div>
      <div className="centered-img">
        <img  loading="lazy" src={img11} alt="" />
      </div>
      <section className="pt-5 pb-5">
        <div className="container">
          <div className="row">
            <div className="col-6"></div>
            <div className="col-6 text-right">
              <a
                className="btn btn-primary mb-1 mr-1"
                href="#carouselExampleIndicators3"
                role="button"
                data-slide="prev"
              >
                <i className="fa fa-arrow-left" />
              </a>
              <a
                className="btn btn-primary mb-1"
                href="#carouselExampleIndicators3"
                role="button"
                data-slide="next"
              >
                <i className="fa fa-arrow-right" />
              </a>
            </div>
            <div className="col-12">
              <div
                id="carouselExampleIndicators3"
                className="carousel slide"
                data-ride="carousel"
              >
                <div className="carousel-inner">
                  <div className="carousel-item active">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img12}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img13}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img14}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img15}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img16}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img17}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img18}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img19}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img20}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img21}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
      <div className="centered-img">
        <img  loading="lazy" src={img22} alt="" />
      </div>
      <section className="pt-5 pb-5">
        <div className="container">
          <div className="row">
            <div className="col-6"></div>
            <div className="col-6 text-right">
              <a
                className="btn btn-primary mb-1 mr-1"
                href="#carouselExampleIndicators4"
                role="button"
                data-slide="prev"
              >
                <i className="fa fa-arrow-left" />
              </a>
              <a
                className="btn btn-primary mb-1"
                href="#carouselExampleIndicators4"
                role="button"
                data-slide="next"
              >
                <i className="fa fa-arrow-right" />
              </a>
            </div>
            <div className="col-12">
              <div
                id="carouselExampleIndicators4"
                className="carousel slide"
                data-ride="carousel"
              >
                <div className="carousel-inner">
                  <div className="carousel-item active">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img23}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img24}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img25}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img26}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img27}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img27}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
      <section className="pt-5 pb-5">
        <div className="container">
          <div className="row">
            <div className="col-6"></div>
            <div className="col-6 text-right">
              <a
                className="btn btn-primary mb-1 mr-1"
                href="#carouselExampleIndicators5"
                role="button"
                data-slide="prev"
              >
                <i className="fa fa-arrow-left" />
              </a>
              <a
                className="btn btn-primary mb-1"
                href="#carouselExampleIndicators5"
                role="button"
                data-slide="next"
              >
                <i className="fa fa-arrow-right" />
              </a>
            </div>
            <div className="col-12">
              <div
                id="carouselExampleIndicators5"
                className="carousel slide"
                data-ride="carousel"
              >
                <div className="carousel-inner">
                  <div className="carousel-item active">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img28}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img29}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img30}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img31}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img32}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img33}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img34}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img35}
                          />
                        </div>
                      </div>
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img36}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                  <div className="carousel-item">
                    <div className="row">
                      <div className="col-md-4 mb-1">
                        <div className="card">
                          <img  loading="lazy"
                            className="img-fluid"
                            alt="100%x280"
                            src={img37}
                          />
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </div>
  );
};

export default RuHistory;
